lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54l15/HardwareSerial.cpp
#include "HardwareSerial.h"

#include "Arduino.h"

#include <string.h>

namespace {

static constexpr uint32_t kPselDisconnected = 0xFFFFFFFFUL;
static constexpr uint32_t kRxFrameTimeoutBits = 32UL;
static constexpr uint32_t kBridgeDirectWriteMax = 16UL;
static constexpr uint32_t kBridgeDirectWriteGapUs = 1000UL;

// UARTE register offsets.
static constexpr uint32_t U_TASKS_FLUSHRX      = 0x01CUL;
static constexpr uint32_t U_TASKS_DMA_RX_START = 0x028UL;
static constexpr uint32_t U_TASKS_DMA_RX_STOP  = 0x02CUL;
static constexpr uint32_t U_TASKS_DMA_TX_START = 0x050UL;
static constexpr uint32_t U_TASKS_DMA_TX_STOP  = 0x054UL;

static constexpr uint32_t U_EVENTS_ERROR       = 0x114UL;
static constexpr uint32_t U_EVENTS_RXTO        = 0x124UL;
static constexpr uint32_t U_EVENTS_TXSTOPPED   = 0x130UL;
static constexpr uint32_t U_EVENTS_DMA_RX_END  = 0x14CUL;
static constexpr uint32_t U_EVENTS_DMA_RX_READY = 0x150UL;
static constexpr uint32_t U_EVENTS_DMA_TX_READY = 0x164UL;
static constexpr uint32_t U_EVENTS_DMA_TX_END  = 0x168UL;
static constexpr uint32_t U_EVENTS_DMA_TX_BUSERROR = 0x170UL;
static constexpr uint32_t U_EVENTS_FRAMETIMEOUT = 0x174UL;

static constexpr uint32_t U_SHORTS             = 0x200UL;
static constexpr uint32_t U_INTENSET           = 0x304UL;
static constexpr uint32_t U_INTENCLR           = 0x308UL;

static constexpr uint32_t U_ERRORSRC           = 0x480UL;
static constexpr uint32_t U_ENABLE             = 0x500UL;
static constexpr uint32_t U_BAUDRATE           = 0x524UL;
static constexpr uint32_t U_CONFIG             = 0x56CUL;
static constexpr uint32_t U_ADDRESS            = 0x574UL;
static constexpr uint32_t U_FRAMETIMEOUT       = 0x578UL;

static constexpr uint32_t U_PSEL_TXD           = 0x604UL;
static constexpr uint32_t U_PSEL_CTS           = 0x608UL;
static constexpr uint32_t U_PSEL_RXD           = 0x60CUL;
static constexpr uint32_t U_PSEL_RTS           = 0x610UL;

static constexpr uint32_t U_DMA_RX_PTR         = 0x704UL;
static constexpr uint32_t U_DMA_RX_MAXCNT      = 0x708UL;
static constexpr uint32_t U_DMA_RX_AMOUNT      = 0x70CUL;
static constexpr uint32_t U_DMA_TX_PTR         = 0x73CUL;
static constexpr uint32_t U_DMA_TX_MAXCNT      = 0x740UL;

static inline volatile uint32_t& reg32(uintptr_t addr) {
    return *reinterpret_cast<volatile uint32_t*>(addr);
}

static inline uint32_t make_psel(uint8_t port, uint8_t pin) {
    return (static_cast<uint32_t>(pin) & 0x1FU) |
           ((static_cast<uint32_t>(port) & 0x7UL) << 5U);
}

static bool decode_pin(uint8_t pin, uint8_t* port, uint8_t* p) {
    return pinToPortPin(pin, port, p);
}

static NRF_GPIO_Type* gpio_for_port(uint8_t port) {
    switch (port) {
        case 0: return NRF_P0;
        case 1: return NRF_P1;
        case 2: return NRF_P2;
        default: return nullptr;
    }
}

static void configure_pin_output(uint8_t port, uint8_t pin, bool high) {
    NRF_GPIO_Type* gpio = gpio_for_port(port);
    if (gpio == nullptr) {
        return;
    }
    const uint32_t bit = (1UL << pin);
    gpio->DIRSET = bit;
    if (high) {
        gpio->OUTSET = bit;
    } else {
        gpio->OUTCLR = bit;
    }
}

static void configure_pin_input(uint8_t port, uint8_t pin, bool pullup) {
    NRF_GPIO_Type* gpio = gpio_for_port(port);
    if (gpio == nullptr) {
        return;
    }
    const uint32_t bit = (1UL << pin);
    gpio->DIRCLR = bit;

    uint32_t cnf = gpio->PIN_CNF[pin];
    cnf &= ~(GPIO_PIN_CNF_DIR_Msk | GPIO_PIN_CNF_INPUT_Msk | GPIO_PIN_CNF_PULL_Msk);
    cnf |= (GPIO_PIN_CNF_DIR_Input << GPIO_PIN_CNF_DIR_Pos);
    cnf |= GPIO_PIN_CNF_INPUT_Connect;
    cnf |= (pullup ? GPIO_PIN_CNF_PULL_Pullup : GPIO_PIN_CNF_PULL_Disabled);
    gpio->PIN_CNF[pin] = cnf;
}

/* Convert baud rate to the nearest supported UARTE BAUDRATE preset.
 * The nRF54L15 UARTE exposes fixed presets rather than a general divisor.
 */
static uint32_t baud_to_reg(unsigned long baud) {
    if (baud <= 0U) {
        return UARTE_BAUDRATE_BAUDRATE_Baud9600;
    }

    struct BaudPreset {
        unsigned long baud;
        uint32_t reg;
    };

    static constexpr BaudPreset kPresets[] = {
        {1200UL, UARTE_BAUDRATE_BAUDRATE_Baud1200},
        {2400UL, UARTE_BAUDRATE_BAUDRATE_Baud2400},
        {4800UL, UARTE_BAUDRATE_BAUDRATE_Baud4800},
        {9600UL, UARTE_BAUDRATE_BAUDRATE_Baud9600},
        {14400UL, UARTE_BAUDRATE_BAUDRATE_Baud14400},
        {19200UL, UARTE_BAUDRATE_BAUDRATE_Baud19200},
        {28800UL, UARTE_BAUDRATE_BAUDRATE_Baud28800},
        {31250UL, UARTE_BAUDRATE_BAUDRATE_Baud31250},
        {38400UL, UARTE_BAUDRATE_BAUDRATE_Baud38400},
        {56000UL, UARTE_BAUDRATE_BAUDRATE_Baud56000},
        {57600UL, UARTE_BAUDRATE_BAUDRATE_Baud57600},
        {76800UL, UARTE_BAUDRATE_BAUDRATE_Baud76800},
        {115200UL, UARTE_BAUDRATE_BAUDRATE_Baud115200},
        {230400UL, UARTE_BAUDRATE_BAUDRATE_Baud230400},
        {250000UL, UARTE_BAUDRATE_BAUDRATE_Baud250000},
        {460800UL, UARTE_BAUDRATE_BAUDRATE_Baud460800},
        {921600UL, UARTE_BAUDRATE_BAUDRATE_Baud921600},
        {1000000UL, UARTE_BAUDRATE_BAUDRATE_Baud1M},
    };

    uint32_t bestIndex = 0U;
    unsigned long bestDistance =
        (baud > kPresets[0].baud) ? (baud - kPresets[0].baud) : (kPresets[0].baud - baud);
    for (uint32_t i = 1U; i < (sizeof(kPresets) / sizeof(kPresets[0])); ++i) {
        const unsigned long presetBaud = kPresets[i].baud;
        const unsigned long distance =
            (baud > presetBaud) ? (baud - presetBaud) : (presetBaud - baud);
        if (distance < bestDistance) {
            bestDistance = distance;
            bestIndex = i;
        }
    }

    return kPresets[bestIndex].reg;
}

struct UarteFormat {
    uint32_t configReg;
    uint8_t dataMask;
};

static UarteFormat decode_serial_format(uint16_t config) {
    UarteFormat fmt{};
    // Preserve a valid baseline. On nRF54, CONFIG also contains FRAMESIZE and
    // other fields; leaving FRAMESIZE at 0 produces undefined behavior.
    fmt.configReg = (UARTE_CONFIG_HWFC_Disabled << UARTE_CONFIG_HWFC_Pos) |
                    (UARTE_CONFIG_FRAMESIZE_8bit << UARTE_CONFIG_FRAMESIZE_Pos);
    fmt.dataMask = 0xFFU;

    const uint8_t dataBits = static_cast<uint8_t>(5U + ((config >> 1U) & 0x3U));
    if (dataBits < 8U) {
        fmt.dataMask = static_cast<uint8_t>((1U << dataBits) - 1U);
    }

