lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54l15/HardwareSerial.cpp
    const uint8_t paritySel = static_cast<uint8_t>(config & 0x30U);
    if (paritySel == 0x20U || paritySel == 0x30U) {
        fmt.configReg |= (UARTE_CONFIG_PARITY_Included << UARTE_CONFIG_PARITY_Pos);
        fmt.configReg |= ((paritySel == 0x30U ? UARTE_CONFIG_PARITYTYPE_Odd
                                              : UARTE_CONFIG_PARITYTYPE_Even)
                          << UARTE_CONFIG_PARITYTYPE_Pos);
    } else {
        fmt.configReg |= (UARTE_CONFIG_PARITY_Excluded << UARTE_CONFIG_PARITY_Pos);
    }

    fmt.configReg |= (((config & 0x08U) != 0U ? UARTE_CONFIG_STOP_Two
                                               : UARTE_CONFIG_STOP_One)
                      << UARTE_CONFIG_STOP_Pos);

    return fmt;
}

static bool wait_event_timeout_us(uintptr_t base, uint32_t event_off, uint32_t timeout_us) {
    const unsigned long start = micros();
    while ((unsigned long)(micros() - start) < timeout_us) {
        if (reg32(base + event_off) != 0U) {
            return true;
        }
    }
    return reg32(base + event_off) != 0U;
}

static uint32_t serial_byte_timeout_us(unsigned long baud, uint32_t bytes) {
    if (baud == 0UL) {
        baud = 9600UL;
    }
    if (bytes == 0U) {
        bytes = 1U;
    }
    // 12 bits/byte includes start/data/parity/stop margin.
    const uint32_t per_byte = static_cast<uint32_t>((12000000ULL + baud - 1ULL) / baud);
    // Keep this small: Serial.available()/read() should not block for milliseconds.
    // Long blocking delays will starve the cooperative BLE stack and cause 0x08
    // supervision timeouts under load.
    // Tuned compromise: keep polling responsive while giving RX enough dwell time
    // to catch the first byte of a burst when called periodically.
    const uint32_t margin = 500UL;
    return (per_byte * bytes) + margin;
}

static constexpr uint32_t kUarteRxInterruptMask =
    UARTE_INTENCLR_ERROR_Msk |
    UARTE_INTENCLR_RXTO_Msk |
    UARTE_INTENCLR_FRAMETIMEOUT_Msk |
    UARTE_INTENCLR_DMARXEND_Msk |
    UARTE_INTENCLR_DMARXREADY_Msk;
static constexpr uint32_t kUarteTxInterruptMask =
    UARTE_INTENCLR_TXSTOPPED_Msk |
    UARTE_INTENCLR_DMATXBUSERROR_Msk;
static uint8_t g_ownedConstlatUsers = 0U;

extern "C" void nrf54l15_wire_handle_shared_irq(const NRF_TWIM_Type* twim);

static bool uart_try_irqn_for_instance(const NRF_UARTE_Type* uart, IRQn_Type* irqn) {
    if (irqn == nullptr || uart == nullptr) {
        return false;
    }

    const uintptr_t base = reinterpret_cast<uintptr_t>(uart);
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE00)) {
        *irqn = SPIM00_IRQn;
        return true;
    }
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE20)) {
        *irqn = SPIM20_IRQn;
        return true;
    }
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE21)) {
        *irqn = SPIM21_IRQn;
        return true;
    }
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE22)) {
        *irqn = SPIM22_IRQn;
        return true;
    }
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE30)) {
        *irqn = SPIM30_IRQn;
        return true;
    }
    return false;
}

static HardwareSerial* g_uarte00Owner = nullptr;
static HardwareSerial* g_uarte20Owner = nullptr;
static HardwareSerial* g_uarte21Owner = nullptr;
static HardwareSerial* g_uarte22Owner = nullptr;
static HardwareSerial* g_uarte30Owner = nullptr;
static HardwareSerial* g_unknownOwner = nullptr;

static HardwareSerial*& uart_owner_slot(const NRF_UARTE_Type* uart) {
    const uintptr_t base = reinterpret_cast<uintptr_t>(uart);
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE00)) {
        return g_uarte00Owner;
    }
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE20)) {
        return g_uarte20Owner;
    }
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE21)) {
        return g_uarte21Owner;
    }
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE22)) {
        return g_uarte22Owner;
    }
    if (base == reinterpret_cast<uintptr_t>(NRF_UARTE30)) {
        return g_uarte30Owner;
    }
    return g_unknownOwner;
}

}  // namespace

extern "C" void SPIM00_IRQHandler(void) {
    if (g_uarte00Owner != nullptr) {
        g_uarte00Owner->handleIrq();
    }
}

extern "C" void SPIM20_IRQHandler(void) {
    if (g_uarte20Owner != nullptr) {
        g_uarte20Owner->handleIrq();
    }
}

extern "C" void SPIM21_IRQHandler(void) {
    if (g_uarte21Owner != nullptr) {
        g_uarte21Owner->handleIrq();
    }
}

extern "C" void SPIM22_IRQHandler(void) {
    if (g_uarte22Owner != nullptr) {
        g_uarte22Owner->handleIrq();
    }
    nrf54l15_wire_handle_shared_irq(NRF_TWIM22);
}

extern "C" void SPIM30_IRQHandler(void) {
    if (g_uarte30Owner != nullptr) {
        g_uarte30Owner->handleIrq();
    }
    nrf54l15_wire_handle_shared_irq(NRF_TWIM30);
}

HardwareSerial::HardwareSerial(NRF_UARTE_Type* uart, uint8_t txPin, uint8_t rxPin)
    : _uart(uart),
      _txPin(txPin),
      _rxPin(rxPin),
      _configured(false),
      _constlatOwned(false),
      _baud(9600UL),
      _config(0U),
      _rxHead(0U),
      _rxTail(0U),
      _rxCount(0U),
      _rxDropped(0U),
      _rxDmaBuffer{{0U}, {0U}},
      _rxDmaActive(0U),
      _rxDmaPrepared(1U),
      _rxDmaRunning(false),
      _rxDmaObservedAmount(0U),
      _rxDmaLastActivityUs(0U),
      _txHead(0U),
      _txTail(0U),
      _txCount(0U),
      _txDmaCount(0U),
      _txDmaRunning(false),
      _txBuffer{0},
      _dataMask(0xFFU),
      _txRing{0},
      _rxRing{0} {}

void HardwareSerial::commitRxBytes(const uint8_t* data, uint32_t amount) {
    if (data == nullptr || amount == 0U) {
        return;
    }
    if (amount > kRxDmaChunkSize) {
        amount = kRxDmaChunkSize;
    }

    for (uint32_t i = 0; i < amount; ++i) {
        const uint8_t value = data[i];
        if (_rxCount >= kRxRingSize) {
            ++_rxDropped;
        } else {
            _rxRing[_rxHead] = value;
            _rxHead = static_cast<uint16_t>(
                (_rxHead + 1U) & static_cast<uint16_t>(kRxRingSize - 1U));
            ++_rxCount;
        }
    }
}

void HardwareSerial::begin(unsigned long baud) {
    begin(baud, SERIAL_8N1);
}

