lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54l15/HardwareSerial.cpp
void HardwareSerial::begin(unsigned long baud, uint16_t config) {
    if (_uart == nullptr) {
        return;
    }
    if (_configured) {
        end();
    }

    uint8_t txPort = 0, tx = 0, rxPort = 0, rx = 0;
    if (!decode_pin(_txPin, &txPort, &tx) || !decode_pin(_rxPin, &rxPort, &rx)) {
        return;
    }

    configure_pin_output(txPort, tx, true);
    configure_pin_input(rxPort, rx, true);
    requestConstlatIfNeeded();

    const uintptr_t base = reinterpret_cast<uintptr_t>(_uart);

    reg32(base + U_ENABLE) = UARTE_ENABLE_ENABLE_Disabled;
    reg32(base + U_PSEL_TXD) = make_psel(txPort, tx);
    reg32(base + U_PSEL_RXD) = make_psel(rxPort, rx);
    reg32(base + U_PSEL_CTS) = kPselDisconnected;
    reg32(base + U_PSEL_RTS) = kPselDisconnected;
    const UarteFormat fmt = decode_serial_format(config);
    _dataMask = fmt.dataMask;
    reg32(base + U_CONFIG) = fmt.configReg |
                             (UARTE_CONFIG_FRAMETIMEOUT_Enabled << UARTE_CONFIG_FRAMETIMEOUT_Pos);
    reg32(base + U_BAUDRATE) = baud_to_reg(baud);
    reg32(base + U_ADDRESS) = 0U;
    reg32(base + U_FRAMETIMEOUT) = kRxFrameTimeoutBits;
    reg32(base + U_SHORTS) |= UARTE_SHORTS_DMA_TX_END_DMA_TX_STOP_Msk;
    reg32(base + U_ENABLE) = UARTE_ENABLE_ENABLE_Enabled;

    _baud = baud;
    _config = config;
    _rxHead = 0U;
    _rxTail = 0U;
    _rxCount = 0U;
    _rxDropped = 0U;
    _rxDmaActive = 0U;
    _rxDmaPrepared = 1U;
    _rxDmaRunning = false;
    _rxDmaObservedAmount = 0U;
    _rxDmaLastActivityUs = 0U;
    _txHead = 0U;
    _txTail = 0U;
    _txCount = 0U;
    _txDmaCount = 0U;
    _txDmaRunning = false;
    _configured = true;

    IRQn_Type irqn = Reset_IRQn;
    if (uart_try_irqn_for_instance(_uart, &irqn)) {
        HardwareSerial*& owner = uart_owner_slot(_uart);
        owner = this;
        NVIC_DisableIRQ(irqn);
        NVIC_ClearPendingIRQ(irqn);
        NVIC_SetPriority(irqn, 2U);
        NVIC_EnableIRQ(irqn);
    }
    reg32(base + U_EVENTS_DMA_TX_READY) = 0U;
    reg32(base + U_EVENTS_DMA_TX_END) = 0U;
    reg32(base + U_EVENTS_DMA_TX_BUSERROR) = 0U;
    reg32(base + U_EVENTS_TXSTOPPED) = 0U;
    reg32(base + U_DMA_TX_PTR) =
        static_cast<uint32_t>(reinterpret_cast<uintptr_t>(&_txBuffer[0]));
    reg32(base + U_DMA_TX_MAXCNT) = 0U;
    reg32(base + U_TASKS_DMA_TX_START) = UARTE_TASKS_DMA_TX_START_START_Trigger;
    wait_event_timeout_us(base, U_EVENTS_TXSTOPPED, 2000UL);
    reg32(base + U_EVENTS_DMA_TX_READY) = 0U;
    reg32(base + U_EVENTS_TXSTOPPED) = 0U;
    reg32(base + U_INTENCLR) = kUarteTxInterruptMask;
    reg32(base + U_INTENSET) = kUarteTxInterruptMask;
    startRxDma();
}

void HardwareSerial::end() {
    if (_uart == nullptr) {
        return;
    }
    stopRxDma();

    const uintptr_t base = reinterpret_cast<uintptr_t>(_uart);
    reg32(base + U_INTENCLR) = kUarteRxInterruptMask | kUarteTxInterruptMask;
    reg32(base + U_SHORTS) &= ~UARTE_SHORTS_DMA_TX_END_DMA_TX_STOP_Msk;
    reg32(base + U_TASKS_DMA_TX_STOP) = UARTE_TASKS_DMA_TX_STOP_STOP_Trigger;
    reg32(base + U_ENABLE) = UARTE_ENABLE_ENABLE_Disabled;

    reg32(base + U_PSEL_TXD) = kPselDisconnected;
    reg32(base + U_PSEL_RXD) = kPselDisconnected;
    reg32(base + U_PSEL_CTS) = kPselDisconnected;
    reg32(base + U_PSEL_RTS) = kPselDisconnected;

    IRQn_Type irqn = Reset_IRQn;
    if (uart_try_irqn_for_instance(_uart, &irqn)) {
        HardwareSerial*& owner = uart_owner_slot(_uart);
        if (owner == this) {
            NVIC_DisableIRQ(irqn);
            NVIC_ClearPendingIRQ(irqn);
            owner = nullptr;
        }
    }

    _configured = false;
    _rxHead = 0U;
    _rxTail = 0U;
    _rxCount = 0U;
    _txHead = 0U;
    _txTail = 0U;
    _txCount = 0U;
    _txDmaCount = 0U;
    _txDmaRunning = false;
    releaseConstlatIfNeeded();
}

bool HardwareSerial::setPins(int8_t rxPin, int8_t txPin) {
    if (_uart == nullptr) {
        return false;
    }

    const uint8_t nextRxPin = (rxPin >= 0) ? static_cast<uint8_t>(rxPin) : _rxPin;
    const uint8_t nextTxPin = (txPin >= 0) ? static_cast<uint8_t>(txPin) : _txPin;

    uint8_t txPort = 0;
    uint8_t tx = 0;
    uint8_t rxPort = 0;
    uint8_t rx = 0;
    if (!decode_pin(nextTxPin, &txPort, &tx) || !decode_pin(nextRxPin, &rxPort, &rx)) {
        return false;
    }

    const bool wasConfigured = _configured;
    const unsigned long baud = _baud;
    const uint16_t config = _config;

    if (wasConfigured) {
        end();
    }

    _txPin = nextTxPin;
    _rxPin = nextRxPin;

    if (!wasConfigured) {
        return true;
    }

    begin(baud, config);
    return _configured;
}

void HardwareSerial::startRxDma() {
    if (!_configured || _uart == nullptr) {
        return;
    }
    if (_constlatOwned) {
        NRF_POWER->TASKS_CONSTLAT = POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Trigger;
    }

    const uintptr_t base = reinterpret_cast<uintptr_t>(_uart);

    reg32(base + U_INTENCLR) = kUarteRxInterruptMask;
    reg32(base + U_EVENTS_DMA_RX_END) = 0U;
    reg32(base + U_EVENTS_DMA_RX_READY) = 0U;
    reg32(base + U_EVENTS_ERROR) = 0U;
    reg32(base + U_EVENTS_RXTO) = 0U;
    reg32(base + U_EVENTS_FRAMETIMEOUT) = 0U;
    reg32(base + U_ERRORSRC) = 0xFFFFFFFFUL;

    // Enable FRAMETIMEOUT→DMA_RX_STOP shortcut so the idle-line timeout causes a
    // proper DMA stop that fires DMA_RX_END with the correct byte count.
    // DMA_RX_AMOUNT is only valid after a DMA completion event; without this
    // shortcut, flushPartialRxDma would read a stale count from the previous
    // transfer and corrupt the ring buffer.
    reg32(base + U_SHORTS) |= UARTE_SHORTS_FRAMETIMEOUT_DMA_RX_STOP_Msk;

    memset(_rxDmaBuffer[_rxDmaActive], 0, HardwareSerial::kRxDmaChunkSize);
    reg32(base + U_DMA_RX_PTR) =
        static_cast<uint32_t>(reinterpret_cast<uintptr_t>(&_rxDmaBuffer[_rxDmaActive][0]));
    reg32(base + U_DMA_RX_MAXCNT) = HardwareSerial::kRxDmaChunkSize;
    reg32(base + U_TASKS_DMA_RX_START) = UARTE_TASKS_DMA_RX_START_START_Trigger;
    _rxDmaRunning = true;
    _rxDmaObservedAmount = 0U;
    _rxDmaLastActivityUs = micros();
    reg32(base + U_INTENSET) = kUarteRxInterruptMask;
}

