lolren/NRF54L15-Clean-Arduino-core/hardware/nrf54l15clean/nrf54l15clean/cores/nrf54l15/HardwareSerial.cpp
extern "C" void nrf54l15_serial_prepare_idle_sleep(void) {
    if (g_ownedConstlatUsers != 0U) {
        NRF_POWER->TASKS_CONSTLAT = POWER_TASKS_CONSTLAT_TASKS_CONSTLAT_Trigger;
    }
}

extern "C" uint8_t nrf54l15_constlat_users_active(void) {
    return (g_ownedConstlatUsers != 0U) ? 1U : 0U;
}

static constexpr uint8_t kSerialPinDisconnected = 0xFFU;

#if defined(NRF54L15_CLEAN_SERIAL_DISABLED)
HardwareSerial Serial(NRF_UARTE21, kSerialPinDisconnected, kSerialPinDisconnected);
HardwareSerial Serial1(NRF_UARTE20, kSerialPinDisconnected, kSerialPinDisconnected);
#elif defined(NRF54L15_CLEAN_SERIAL_ROUTE_HEADER)
#if defined(NRF54L15_CLEAN_SERIAL_ROUTE_HEADER_SWAP_INSTANCES)
HardwareSerial Serial(NRF_UARTE20, PIN_SERIAL_TX, PIN_SERIAL_RX);
HardwareSerial Serial1(NRF_UARTE21, PIN_SAMD11_RX, PIN_SAMD11_TX);
#else
HardwareSerial Serial(NRF_UARTE21, PIN_SERIAL_TX, PIN_SERIAL_RX);
HardwareSerial Serial1(NRF_UARTE20, PIN_SAMD11_RX, PIN_SAMD11_TX);
#endif
#else
HardwareSerial Serial(NRF_UARTE20, PIN_SAMD11_RX, PIN_SAMD11_TX);
HardwareSerial Serial1(NRF_UARTE21, PIN_SERIAL1_TX, PIN_SERIAL1_RX);
#endif

// Compatibility alias for sketches/libraries that expect Serial2.
HardwareSerial& Serial2 = Serial1;

extern "C" uint8_t nrf54l15_bridge_serial_active(void) {
    const bool serialBridgeActive =
        Serial.isConfigured() && Serial.usesPins(PIN_SAMD11_RX, PIN_SAMD11_TX);
    const bool serial1BridgeActive =
        Serial1.isConfigured() && Serial1.usesPins(PIN_SAMD11_RX, PIN_SAMD11_TX);
    return (serialBridgeActive || serial1BridgeActive) ? 1U : 0U;
}

extern "C" void nrf54l15_serial_idle_service(void) {
    Serial.serviceTxDma();
    Serial1.serviceTxDma();
}
